
welcome_message = "Привет 🤖\n\n✅ Выбери, что хочешь сделать."

enter_os_message = "Выбери свою операционную систему."

wait_for_admin_message = "✅ Дождитесь, когда администатор (@stxddd) одобрит заявку."

rejected_message = "❌ Вам отказано в доступе"

get_instruction_os_message = '✅ Какое устройство Вы хотите подключть?'

marzban_day_limit_message = "❌ Слишком много запросов сегодня. Попробуйте завтра."

android_instruction_message = "\n".join(('⚙️ Инструкиця для подключения Android устройства\n\n',
                               '1. Установите приложение Hiddify. (https://play.google.com/store/apps/details?id=app.hiddify.com)\n',
                               '2. Скопируйте ключ доступа, отправленный сообщением ниже.\n',
                               '3. Запустите Hiddify. Сверху нажмите на "+" -> Добавить из буфера обмена.\n',
                               '4. Запустите VPN, нажав на круглую кнопку на главном экране.\n\n',
                               '✅ Приятного использования. По вопросам @stxddd'))

windows_instruction_message = "\n".join(('⚙️ Инструкиця для подключения Android устройства\n\n',
                               '1. Установите приложение Hiddify. (https://hiddify.com/)\n',
                               '2. Скопируйте ключ доступа, отправленный сообщением ниже.\n',
                               '3. Запустите Hiddify. Сверху нажмите на "+" -> Добавить из буфера обмена.\n',
                               '4. Запустите VPN, нажав на круглую кнопку на главном экране.\n',
                               '5. ЕСЛИ вы не наблюдаете работы VPN, настройте:\n',
                               '5.1 Поставьте Регион "Другой" и перключите режим Системный прокси -> VPN в Настройках конфигурации.\n ',
                               '5.2 Для включения режима VPN необходимо установить запуск приложения от имени администратора в свойствах ярлыка.\n',
                               '5.3 После данного действия, перезапускаем приложение и включаем режим VPN в настройках слева от "+".\n\n',
                               '✅ Приятного использования. По вопросам @stxddd'))

ios_instruction_message = "\n".join(('⚙️ Инструкиця для подключения IOS устройства\n\n',
                               '1. Установите приложение Streisand. (https://apps.apple.com/ru/app/streisand/id6450534064)\n'
                               '2. Скопируйте ключ доступа, отправленный сообщением ниже.\n',
                               '3. Запустите Streisand. Сверху нажмите на "+" -> Добавить из буфера обмена.\n',
                               '4 Добавьте виджет Streisand на главный экран. Включайте VPN только через него.\n',
                               '5. Запустите VPN, нажав на круглую кнопку экране.\n\n',
                               '✅ Приятного использования. По вопросам @stxddd'))

mac_instruction_message = "\n".join(('⚙️ Инструкиця для подключения Mac устройства\n\n',
                               '1. Установите приложение Streisand. (https://apps.apple.com/ru/app/streisand/id6450534064)\n'
                               '2. Скопируйте ключ доступа, отправленный сообщением ниже.\n',
                               '3. Запустите Streisand. Сверху нажмите на "+" -> Добавить из буфера обмена.\n',
                               '3.1 Добавьте виджет Streisand на главный экран. Включайте VPN только через него.\n',
                               '4. Запустите VPN, нажав на круглую кнопку на главном экране.\n\n',
                               '✅ Приятного использования. По вопросам @stxddd'))

androidTV_instruction_message = "\n".join((f'⚙️ Инструкиця для подключения Android TV устройства\n\n',
                               f'1. Установите приложение Hiddify из Google Play\n',
                               f'2. Как вставить ключ на телевизор.\n',
                               f'2.1. Скачайте приложение Google TV. Откройте Google Play Store на своем Android-смартфоне или App Store на iPhone. В строке поиска введите «Google TV» и найдите официальное приложение от Google. Нажмите кнопку «Установить», чтобы загрузить и установить приложение на ваше устройство.\n',
                               f'2.2 Подключите телевизор к интернету. Запустите приложение Google TV на своем смартфоне. Войдите в приложение, используя свою учетную запись Google. Убедитесь, что вы используете ту же учетную запись, которую вы хотите подключить к телевизору. \n',
                               f'2.3 В приложении Google TV выберите опцию «Подключить к телевизору» или найдите кнопку «Добавить устройство» (может отображаться в виде значка телевизора). Приложение начнет искать доступные устройства. Убедитесь, что ваш телевизор включен и находится в одной сети Wi-Fi с вашим смартфоном. Когда ваш телевизор появится в списке доступных устройств, выберите его. \n',
                               f'3. Запустите Hiddify. Сверху нажмите на "+" -> Ввести вручную. С помощью режима клавиатуры в Google TV вставьте ключ из буфера в появившееся поле. Нажмите «Сохранить».\n',
                               f'4. Запустите VPN, нажав на круглую кнопку на главном экране.\n\n',
                               f'✅ Приятного использования. По вопросам @stxddd'))

incorrect_os_message = '❌ Нет данных о такой ОС.'

enter_period_message = '⚙️ Выберите период подписки.'